GHB2/src/Catalogs/гхб_Помещения/гхб_Помещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гхб_Помещения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>УИДСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

GHB2/src/InformationRegisters/гхб_РуководителиЛокаций/гхб_РуководителиЛокаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_РуководителиЛокаций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/Documents/гхб_СвойстваПомещений/гхб_СвойстваПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гхб_СвойстваПомещений</name>
  <registerRecords>InformationRegister.гхб_РуководителиЛокаций</registerRecords>
  <registerRecords>InformationRegister.гхб_СвойстваПомещений</registerRecords>
  <registerRecords>InformationRegister.гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМест</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.гхб_ВидыОперацийСвойстваПомещений</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Локации</name>
    <attributes>
      <name>Локация</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеНовое</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Руководитель</name>
      <type>
        <types>CatalogRef.гхб_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>РуководительНовый</name>
      <type>
        <types>CatalogRef.гхб_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Закрыть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрытьНовое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УИДСинхронизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьДляЗакрепленияПарковочныхМест</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьДляЗакрепленияПарковочныхМестНовое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Корпуса</name>
    <attributes>
      <name>Корпус</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Локация</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛокацияНовая</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеНовое</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Закрыть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрытьНовое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УИДСинхронизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлементыСтроений</name>
    <attributes>
      <name>ЭлементСтроения</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Локация</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛокацияНовая</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Корпус</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>КорпусНовый</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеНовое</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Закрыть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрытьНовое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УИДСинхронизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Помещения</name>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Локация</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛокацияНовая</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Корпус</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>КорпусНовый</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭлементСтроения</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭлементСтроенияНовый</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеНовое</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПомещения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПомещенияНовый</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДробнаяЧасть</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДробнаяЧастьНовая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Площадь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПлощадьНовая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПомещения</name>
      <type>
        <types>CatalogRef.гхб_ТипыПомещений</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипПомещенияНовый</name>
      <type>
        <types>CatalogRef.гхб_ТипыПомещений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановоеКоличествоРабочихМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПлановоеКоличествоРабочихМестНовое</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НетРабочихМест</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НетРабочихМестНовое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УточняющаяИнформация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УточняющаяИнформацияНовая</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНаГенеральномПлане</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНаГенеральномПланеНовый</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Закрыть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрытьНовое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УИДСинхронизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоступВПомещениеПоКлючу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступВПомещениеПоКлючуНовый</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаличиеОхраннойСигнализации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаличиеОхраннойСигнализацииНовое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнутреннийНомерКТ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВнутреннийНомерКТНовый</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаличиеКТ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаличиеКТНовое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СогласованиеДоступаСВысшимРуководителем</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СогласованиеДоступаСВысшимРуководителемНовое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщегоПользования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщегоПользованияНовый</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

GHB2/src/Documents/гхб_ЗакреплениеОтветственногоЗаЛокацию/гхб_ЗакреплениеОтветственногоЗаЛокацию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гхб_ЗакреплениеОтветственногоЗаЛокацию</name>
  <registerRecords>InformationRegister.гхб_ОтветственныеЗаЛокации</registerRecords>
  <attributes>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЛокацию</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЛокациюСуществующий</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </attributes>
</mdclass:Document>

GHB2/src/Catalogs/гхб_ТипыПомещений/гхб_ТипыПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гхб_ТипыПомещений</name>
  <predefined>
    <items>
      <name>ЭлементСтроения</name>
      <description>Елемент будівлі</description>
    </items>
    <items>
      <name>Корпус</name>
      <description>Корпус</description>
    </items>
    <items>
      <name>Локация</name>
      <description>Локація</description>
    </items>
  </predefined>
  <attributes>
    <name>ЭтоПомещение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляКонсервацииПомещений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

GHB2/src/Catalogs/гхб_Помещения/Forms/ФормаГруппы/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСвойстваПомещения();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваПомещения()
	
	_СвойстваПомещения = Справочники.гхб_Помещения.ВернутьДанныеПомещения(Объект.Ссылка, Ложь);
	
	Локация = _СвойстваПомещения.Локация;
	Корпус = _СвойстваПомещения.Корпус;
	ТипПомещения = _СвойстваПомещения.ТипПомещения;
	Закрыть = _СвойстваПомещения.Закрыть;
	Площадь = _СвойстваПомещения.Площадь;
	Руководитель = _СвойстваПомещения.Руководитель;
	ОтветственныйЗаЛокацию = _СвойстваПомещения.ОтветственныйЗаЛокацию;
	ИспользоватьДляЗакрепленияПарковочныхМест = _СвойстваПомещения.ИспользоватьДляЗакрепленияПарковочныхМест;
	
	Элементы.Локация.Видимость = (ТипПомещения = Справочники.гхб_ТипыПомещений.Корпус)
		ИЛИ (ТипПомещения = Справочники.гхб_ТипыПомещений.ЭлементСтроения);
		
	Элементы.ИспользоватьДляЗакрепленияПарковочныхМест.Видимость = (ТипПомещения = Справочники.гхб_ТипыПомещений.Локация);
		
	Элементы.Корпус.Видимость = (ТипПомещения = Справочники.гхб_ТипыПомещений.ЭлементСтроения);
	
	Элементы.Руководитель.Видимость = (ТипПомещения = Справочники.гхб_ТипыПомещений.Локация);
	Элементы.Ответственный.Видимость = (ТипПомещения = Справочники.гхб_ТипыПомещений.Локация);
	
	Элементы.ФормаЗакрепитьОтветственногоЗаЛокацией.Видимость = (ТипПомещения = Справочники.гхб_ТипыПомещений.Локация)
		И (РольДоступна(Метаданные.Роли.ПолныеПрава) 
			ИЛИ НЕ (РегистрыСведений.гхб_РуководителиЛокаций.ВернутьЛокацииПоРуководителю(ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо).Найти(Объект.Ссылка) = Неопределено));
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПомещение(Команда)
	
	_Параметры = Новый Структура();
	_Параметры.Вставить("Помещение", Объект.Ссылка);
	_Параметры.Вставить("ТипПомещения", ТипПомещения);
	
	_ОписаниеОповещения = Новый ОписаниеОповещения("РедактироватьПомещениеЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Документ.гхб_СвойстваПомещений.Форма.ФормаДокумента", _Параметры, ЭтотОбъект, , , , _ОписаниеОповещения, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПомещениеЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	ЭтотОбъект.Прочитать();
	ЗаполнитьСвойстваПомещения();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрепитьОтветственногоЗаЛокацией(Команда)
	
	_Параметры = Новый Структура();
	_Параметры.Вставить("Локация", Объект.Ссылка);
	
	_ОписаниеОповещения = Новый ОписаниеОповещения("ЗакрепитьОтветственногоЗаЛокациейЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Документ.гхб_ЗакреплениеОтветственногоЗаЛокацию.Форма.ФормаДокумента", _Параметры, ЭтотОбъект, , , , _ОписаниеОповещения, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрепитьОтветственногоЗаЛокациейЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	//ЭтотОбъект.Прочитать();
	ЗаполнитьСвойстваПомещения();
	
КонецПроцедуры
